module.exports = {
    guildId: "1519364880677867550",

    channels: {
        // ───── SERVER LOGS ─────
        arrivals: "1520444698013995210",
        leaves: "1520444740988964904",
        pseudos: "1530310630048006184",
        profiles: "1530310720179273929",
        boosts: "1530351038421270738",

        // ───── LOGS MESSAGES ─────
        messages: "1519366440375812246",
        messageUpdates: "1530310047756714155",
        messageDeletes: "1530310172897972325k",
        ghostPings: "1530351152531505172",

        // ───── LOGS RÔLES ─────
        roles: "1519374123162271897",
        roleCreates: "1519374244063084644",
        roleDeletes: "1530351275059707934",
        roleUpdates: "1530351392219201648",

        // ───── LOGS SALONS ─────
        channels: "1520108165008592988",
        channelCreates: "1530350051782557817",
        channelDeletes: "1530351880482586827",
        channelUpdates: "1530355868942602362",

        // ───── LOGS MODÉRATION ─────
        blacklist: "1519400651745132575",
        bans: "1520116351904120852",
        unbans: "1530352142328660090",
        mutes: "1520445447263486236",
        unmutes: "1530352229897338931",
        warns: "1530351988708216903",
        kicks: "1530352071596052541",
        jails: "1530352311665164329",

        // ───── LOGS GLOBAL ─────
        voice: "1520445002570792960",
        tickets: "1520445075375521992",
        permImages: "1520445385619804380",
        giveaways: "1530352388223930498",

        // ───── LOGS UTILES ─────
        server: "1520445521158869023",
        ai: "1530314823533985822",
        errors: "1530352521116123357",
        startup: "1530352609720799262",
        commands: "1530352680940343326",

        // ───── LOGS CASINO ─────
        casino: "1520766436388245585",
        casinoBlacklist: "1520771645688647842",
        clanWars: "1520771804610822234",
        casinoEvents: "1523695742978494554"
    }
};
